{
  "independence": {
    "name": "Independence, Missouri",
    "id": 0,
    "isCity": true,
    "isRiver": false,
    "sayings": [
      "first saying",
      "second saying",
      "third saying"
    ],
    "nextPoints": [
      {
        "id": 1,
        "distance": 102
      }
    ],
    "riverData": null
  },
  "kansasRiverCrossing": {
    "name": "Kansas River Crossing",
    "id": 1,
    "isCity": false,
    "isRiver": true,
    "sayings": [
      "first saying",
      "second saying",
      "third saying"
    ],
    "nextPoints": [
      {
        "id": 2,
        "distance": 82
      }
    ],
    "riverData": {
      "riverDepth": 5,
      "riverWidth": 630
    }
  },
  "bigBlueRiverCrossing": {
    "name": "Big Blue River Crossing",
    "id": 2,
    "isCity": false,
    "isRiver": true,
    "sayings": [
      "Big Louie, a trail driver, tells you: Be careful you don't push those animals too hard!  Keep em moving but set them a fair pace.  Can't keep driving 'em so fast or you'll end up with lame-footed animals.  A lame ox is about as good to you as a dead one.",
      "A party leader heading east tells you: We've had enough! Pesky flies all day and mosquitoes all night!  It's either baking sun or oceans of mud -- and sometimes both.  Worry over Indians attacking -- haven't seen any yet, but still a worry.",
      "A lady, Marnie Stewart, tells you:  his prairie is mighty pretty with all the wild flowers and tall grasses.  But there's too much of it! I miss not having a town nearby.  I wonder how many days until I se a town -- a town with real shops , a church, people..."
    ],
    "nextPoints": [
      {
        "id": 3,
        "distance": 118
      }
    ],
    "riverData": {
      "riverDepth": 2,
      "riverWidth": 240
    }
  },
  "fortKearny": {
    "name": "Fort Kearny",
    "id": 3,
    "isCity": true,
    "isRiver": false,
    "sayings": [
      "A fort soldier tells you: The trails from the jumping off places -- Independence, St. Joseph, Council Bluffs -- come together at Fort Kearney.  This new fort was built by the U.S. Army to protect those bound for California and Oregon",
      "Big Louie tells you: The Platte River valley forms a natural round-away from Fort Kearney to Fort Laramie.  Travelers bound for California, Utah, and Oregon all take this road.  Could be ehe easiest Stretch of the whole trip Should see antelope and plenty of buffalo.",
      "A fort kearney scout tells you: The game is still plentiful along here but getting' harder to find.  With so many overlanders,l I don't expect it to last more'n a few years.  Folks shoot the game for spot.  Take a small piece, and let the rest rot in the sun"
    ],
    "nextPoints": [
      {
        "id": 4,
        "distance": 250
      }
    ],
    "riverData": null
  },
  "chimneyRock": {
    "name": "Chimney Rock",
    "id": 4,
    "isCity": false,
    "isRiver": false,
    "sayings": [
      "Alonzo Delano tells you: About noon yesterday we came in sight of Chimney Rock looming up in the distance like the lofty tower of some town.  We did not tire gazing on it.  It was about 20 miles from us, and stayed in sight 'til we reached it today.",
      "Aunt Rebecca Sims tells you: I hear terrible stories about wagon parties running out of food before Oregon -- the whole party starving to death.  We must check our supplies often; e might not get there as soon as we think.  Always plan for the worst, I say.",
      "Celinda Hines tells you: Chimney Rock by moonlight is awfully sublime.  Many Indians came to our wagon with fish to exchange for clothing.  We bought a number.  They understand 'swap' and 'no swap.'  Seem most anxious to get shirts and socks"
    ],
    "nextPoints": [
      {
        "id": 5,
        "distance": 86
      }
    ],
    "riverData": null
  },
  "fortLaramie": {
    "name": "Fort Laramie",
    "id": 5,
    "isCity": true,
    "isRiver": false,
    "sayings": [
      "A mountain man tells you: These greenhorns heading across the Rockies know nothing about surviving in the mountains.  It gets awful cold up there, even in summer.  Many a traveler crossing the mountains too late in the year has gotten snowbound and died!",
      "A Sioux brave tells you: The pawnee are the mortal enemies of the Sioux.  I would not hesitate to kill any Pawene I meet.  But I have never killed a white man.  All I ask from the white man is to leave me alone, and to leave my buffalo alone.",
      "A woman traveler tells you: be warned, stranger, Don't dig a water hole!  Drink only river water.  Salty as the Platte River is -- it's better than the cholera.  We buried my husband last week.  Could use some help with this harness if you can spare the time."
    ],
    "nextPoints": [
      {
        "id": 6,
        "distance": 190
      }
    ],
    "riverData": null
  },
  "independenceRock": {
    "name": "Independence Rock",
    "id": 6,
    "isCity": false,
    "isRiver": false,
    "sayings": [
      "Aunt Rebecca Sims tells you: No butter or cheese or fresh fruit since Fort Laramie! Bless me, but I'd rather have my larder full of food back East than have our names carved on that rock! Well, tis a sight more cheery than all the graves we passed.",
      "Big Louie tells you: Goodbye Platte River! Goodbye sand hills and white buffalo skulls! Now we climb the Sweetwater valley to cross the Continental Divide at South Pass. Once across the Rockies, We'll make a steep descent into the Green River Valley",
      "A young boy tells you: I carved my name way up the side of Independence Rock, near the top.  There are hundreds of names up there! The oldest ones were carved by mountain men and fur trappers -- famous names like Fremond, Bonneville, and DeSmet!"
    ],
    "nextPoints": [
      {
        "id": 7,
        "distance": 102
      }
    ],
    "riverData": null
  },
  "southPass": {
    "name": "South Pass",
    "id": 7,
    "isCity": false,
    "isRiver": false,
    "sayings": [
      "A Mormon traveler tells you: My Family and I travel with 40 other families to the valley of the Great Salt Lake to seek religious freedom.  Back east Mormons are persecuted, In Utah, we'll join together to build a new community.  Changing desert into farm land",
      "An Arapaho Indian tells you: When the white man first crossed our lands their wagons were few.  Now they crowd the trail in great numbers.  The land is overgrazed with their many animals, Do any white men still live in he East?  My people talk of Moving",
      "A young girl tells you: My father is very sick and we are resting here until he gets better.  We have been pushing too hard and our health has suffered when my father is able to travel again, we will go at a slower pace"
    ],
    "nextPoints": [
      {
        "id": 8,
        "distance": 57
      },
      {
        "id": 9,
        "distance": 125
      }
    ],
    "riverData": null
  },
  "greenRiverCrossing": {
    "name": "Green River Crossing",
    "id": 8,
    "isCity": false,
    "isRiver": true,
    "sayings": [
      "A Shoshoni Indian tells you: When wagons first started coming through here, we did not mind.   We even found it good to trade game and fish with the travelers and help them cross the rivers.  Now there are too many white men and too little land for grazing",
      "Big Louie tells you: Five dollars to ferry us over the Green River?  Those ferrymen will make a hundred dollars before breakfast! We'll keep down river until we find a place to ford our wagon and animals.  What little money we have left, we'll keep",
      "A young boy tells you: My family didn't buy enough food in Independence. We have been eating very small rations since Fort Laramie.  Because of that our health is poor.  My sister has mountain fever, so We're stopped here for a while."
    ],
    "nextPoints": [
      {
        "id": 10,
        "distance": 143
      }
    ],
    "riverData": {
      "riverDepth": 21,
      "riverWidth": 412
    }
  },
  "fortBridger": {
    "name": "Fort Bridger",
    "id": 9,
    "isCity": true,
    "isRiver": false,
    "sayings": [
      "Aunt Rebecca tells you: We should've taken the Sublette Cutoff! Not enough at this fort worth the time ait took to get here.  And the outrageous prices!  Foods not fit to eat! Much less pay for.  Some folks'd sell the clothes off our backs if we'd let them",
      "A tired looking woman tells you: One child drowned in a swollen creek east of Fort Laramie. My husband died of typhoid near Independence Rock.  Now I travel alone with my five children. The eldest, Caleb, is eleven.  I fear he'll be a man before we reach Oregon",
      "A trader tells you: This fort was build by Jim Bridger.  Jim was a mountain man before he put in this blacksmith shop and small store to supply the overlanders.  Does a big trade in horses. Jim and his partner, Vasquez"
    ],
    "nextPoints": [
      {
        "id": 10,
        "distance": 162
      }
    ],
    "riverData": null
  },
  "sodaSprings": {
    "name": "Soda Springs",
    "id": 10,
    "isCity": false,
    "isRiver": false,
    "sayings": [
      "Miles Hendrick tells you: I've heard it said that there are many cutoffs to take to shorten the journey -- that by taking all the shortcuts, you can save many days on the trail.  And why not? Saving time and provisions is worth the risk!",
      "Celinda Hines tells you: My, the Soda Springs are so pretty! Seem to spout at regular intervals.  Felt good to just rest and not be jostled in the wagon all day.  When I get to Oregon, I'll have a soft feather bed and never sleep in a wagon again",
      "A young boy tells you: My job every day is to find wood for the cook fire.  Sometimes it's very hard to find enough, so I store extra pieces in a box under the wagon.  On the prairie I gathered buffalo chips to burn when there wasn’t any wood."
    ],
    "nextPoints": [
      {
        "id": 11,
        "distance": 57
      }
    ],
    "riverData": null
  },
  "fortHall": {
    "name": "Fort Hall",
    "id": 11,
    "isCity": true,
    "isRiver": false,
    "sayings": [
      "Miles Hendrick tells you: Well, Friend, this is where we part.  I'm bound for California with an imposing desert to cross.  And you -- you've got the Snake River to cross, which I hear is no picnic!  Write us, you or the Missus, Just as soon as you reach Oregon",
      "Aunt Rebecca tells you: Hear there's mountain sheep around here.  Enough water too, but hardly a stick of wood.  Thank heaven for Fort Hall! But I'm real sorry to be saying goodbye to cousin Miles and all the folks heading for California.",
      "A fellow traveler tells you: Fort Hall is a busy fort!  The wide stretches of meadow grass here are just what our tired animals need,  As for me, I'll fix up the wagon leaks, Amanda's real anxious to wash all the clothes and linens in one of those clear streams."
    ],
    "nextPoints": [
      {
        "id": 12,
        "distance": 182
      }
    ],
    "riverData": null
  },
  "snakeRiverCrossing": {
    "name": "Snake River Crossing",
    "id": 12,
    "isCity": false,
    "isRiver": true,
    "sayings": [
      "Big Louie tells you: See that wild river? That's the Snake.  Many a craft's been swamped in her foaming rapids.  Her waters will travel all the way to Oregon!  We'll be crossing her soon, and then again after Fort Boise.  Take care at the Crossing!",
      "A frantic Wife Tells you: It says right here in the Shively guidebook: \"You must hire an Indian to pilot you at the crossings of the snake river, it being dangerous if not perfectly understood.\"  But my husband insists on crossing without a guide!",
      "An overlander tells you: Down there between those steep lava gorges, twisting and writhing, is the Snake River.  So much water -- and so hard to get to! We've got many miles of desert before Oregon, so be sure to fil your water kegs at the crossing!"
    ],
    "nextPoints": [
      {
        "id": 13,
        "distance": 113
      }
    ],
    "riverData": {
      "riverDepth": 6,
      "riverWidth": 1000
    }
  },
  "fortBoise": {
    "name": "Fort Boise",
    "id": 13,
    "isCity": true,
    "isRiver": false,
    "sayings": [
      "Jacob Hofsteader tells you:  Every night, event though I ache from the day's toils, my head is filled with dreams of the rich farm land of the Willamette Valley.  I will build myself a fine, handsome homestead -- and I'm certain I'll be ich within five years.",
      "A trader with 6 mules tells you: You'll not get yer wagon over them Blue Mountains, mister.  Leave it! Cross yer goods over with pack animals. Pieces of wagons litter the trail -- left by them folks who don't heed good advice.",
      "Aunt Rebecca tells you: At every fort along the trail, prices have been higher than at the previous fort!  This is outrageous! They're taking advantage of us!  If I had the chance to do it again, I'd buy more supplies in Independence"
    ],
    "nextPoints": [
      {
        "id": 14,
        "distance": 160
      }
    ],
    "riverData": null
  },
  "blueMountains": {
    "name": "Blue Mountains",
    "id": 14,
    "isCity": false,
    "isRiver": false,
    "sayings": [
      "Marnie Stewart tells you: We followed the edge of the desert from Fort Boise to the forbidding wall of the Blue Mountains.  The hills were dreadful steep!  Locking both wheels and coming down slow, we got down safe.  Poor Animals!  No grass or water for days.",
      "Jacob Hofsteader tells you:  This valley of the Grande Ronde is the most beautiful sight I've seen in months.  Water and graze in abundance!  And if this valley is so fine, the Willamette must be twice as fine!  We'll be sittin' pretty in our new homestead",
      "A tired overlander tells you:  Since crossing the Snake at Fort Boise, it's been just mountains and desert.  Dust deeper each day -- six inches at times.  No tracks, just clouds of dust. Many cattle choked on the dust after swimming the river, then bled and died."
    ],
    "nextPoints": [
      {
        "id": 15,
        "distance": 55
      },
      {
        "id": 16,
        "distance": 125
      }

    ],
    "riverData": null
  },
  "fortWallaWalla": {
    "name": "Fort Walla Walla",
    "id": 15,
    "isCity": true,
    "isRiver": false,
    "sayings": [
      "A young mother tells you: I've raveled in fear of Indians since our journey began.  As of yet we've seen few.  Those we met helped us cross rivers or sold us vegetables.  Still I fear, I've read grave markers and heard stories of killings in these mountains.",
      "Amy Witherspoon tells you: My cousin Catherine was one of six children orphaned and left at Whitman's Mission.  Lived with them for three years -- until the massacre last November.  She has survived snakebites, stampedes, falls, fights -- not to mention a massacre.",
      "A Cayuse Indian tells you: You ask about the Whitman massacre.  I ask you why Doctor Whitman's medicine did not cure my people's children? Many caught the measles from the strangers.  Why did the medicine poison our children and cure the children of white people?"
    ],
    "nextPoints": [
      {
        "id": 16,
        "distance": 120
      }
    ],
    "riverData": null
  },
  "dalles": {
    "name": "The Dalles",
    "id": 16,
    "isCity": false,
    "isRiver": true,
    "sayings": [
      "a mountain man tells you: These last hundred miles to the Willamette Valley are the roughest -- either rafting down the swift and turbulent Columbia River or driving your wagon over the steep Cascade Mountains.  Hire an Indian guide if you take the river",
      "Amy Witherspoon tells you: My cousin Lydia engaged passage down the Columbia with Indians -- a canoe with 17 people and luggage!  The wind blew so heavy they had to lay by. Near dark, high waves cam eup over their heads!  Finally, they made it to shore safely.",
      "A toll collector tells you: I collect the tolls for the Barlow oad -- A bargain at twice the price! Until last year the overlander had no choice -- everyone floated the Columbia.  Now with Mr. Barlow's new road, you can driver your wagon right into Oregon City!"
    ],
    "nextPoints": [
      {
        "id": 17,
        "distance": 102
      },
      {
        "id": 18,
        "distance": 100
      }
    ],
    "riverData": null
  },
  "columbia": {
    "name": "The Columbia River",
    "id": 17,
    "isCity": false,
    "isRiver": false,
    "sayings": [],
    "nextPoints": [],
    "riverData": null
  },
  "willemetteValley": {
    "name": "The Willemette Valley",
    "id": 18,
    "isCity": false,
    "isRiver": false,
    "sayings": [],
    "nextPoints": [],
    "riverData": null
  }
}